Masmiseim36/nxpSDK/boards/hvpkv11z75m/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTE24 (number 20), FTM0_CH0
  @{ */
#define PINTOOL_FTM_FTM0_CH0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_FTM_FTM0_CH0_PIN 24U    /*!<@brief PORTE pin index: 24 */
                                        /* @} */

/*! @name PORTE25 (number 21), FTM0_CH1
  @{ */
#define PINTOOL_FTM_FTM0_CH1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_FTM_FTM0_CH1_PIN 25U    /*!<@brief PORTE pin index: 25 */
                                        /* @} */

/*! @name PORTC4 (number 49), FTM0_CH3
  @{ */
#define PINTOOL_FTM_FTM0_CH3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_FTM0_CH3_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                        /* @} */

/*! @name PORTC5 (number 50), FTM0_CH2
  @{ */
#define PINTOOL_FTM_FTM0_CH2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_FTM0_CH2_PIN 5U     /*!<@brief PORTC pin index: 5 */
                                        /* @} */

/*! @name PORTD4 (number 61), FTM0_CH4
  @{ */
#define PINTOOL_FTM_FTM0_CH4_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_FTM0_CH4_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                        /* @} */

/*! @name PORTD5 (number 62), FTM0_CH5
  @{ */
#define PINTOOL_FTM_FTM0_CH5_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_FTM0_CH5_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART 1 Receive Data Source Select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 Transmit Data Source Select: UART1_TX pin */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

#define SOPT4_FTM0FLT0_FTM 0x00u /*!<@brief FTM0 Fault 0 Select: FTM0_FLT0 pin */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
